In [1]:
import pandas as pd

In [2]:
dates = pd.date_range('20200625', periods=6)
dates

DatetimeIndex(['2020-06-25', '2020-06-26', '2020-06-27', '2020-06-28',
               '2020-06-29', '2020-06-30'],
              dtype='datetime64[ns]', freq='D')

## 임의의 랜덤한 테이블 만들기

In [3]:
import numpy as np

numpy를 사용하여 랜덤한 값 생성 - 조건 : 행렬크기를 잡아주고, 인덱스 잡아주고, 컬럼명 지정

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2020-06-25 -0.074156  0.602988  0.185044 -0.276203
2020-06-26 -0.179998 -0.047341  2.243783 -0.263655
2020-06-27  0.722831 -0.882125  1.467138  0.283153
2020-06-28  0.135729 -1.461945 -0.663908  2.364393
2020-06-29  0.255790 -0.728395  0.231229 -0.934606
2020-06-30  0.475465  1.174095  0.585591  1.419549

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [7]:
df.index

DatetimeIndex(['2020-06-25', '2020-06-26', '2020-06-27', '2020-06-28',
               '2020-06-29', '2020-06-30'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df.values

array([[-0.07415643,  0.60298765,  0.1850438 , -0.2762034 ],
       [-0.17999837, -0.04734054,  2.24378289, -0.26365534],
       [ 0.72283148, -0.88212518,  1.46713755,  0.28315347],
       [ 0.13572868, -1.46194501, -0.66390784,  2.36439333],
       [ 0.25578988, -0.72839542,  0.23122887, -0.93460647],
       [ 0.47546527,  1.17409461,  0.58559062,  1.41954881]])

In [9]:
df['A']

2020-06-25   -0.074156
2020-06-26   -0.179998
2020-06-27    0.722831
2020-06-28    0.135729
2020-06-29    0.255790
2020-06-30    0.475465
Freq: D, Name: A, dtype: float64

In [10]:
df[0:3]  # 0~2

                   A         B         C         D
2020-06-25 -0.074156  0.602988  0.185044 -0.276203
2020-06-26 -0.179998 -0.047341  2.243783 -0.263655
2020-06-27  0.722831 -0.882125  1.467138  0.283153

In [11]:
df.loc['2020-06-25']

A   -0.074156
B    0.602988
C    0.185044
D   -0.276203
Name: 2020-06-25 00:00:00, dtype: float64

In [12]:
df.iloc[0]

A   -0.074156
B    0.602988
C    0.185044
D   -0.276203
Name: 2020-06-25 00:00:00, dtype: float64

In [13]:
df.iloc[0,0]

-0.07415642616726582

In [14]:
df.loc['2020-06-25','A']

-0.07415642616726582

In [15]:
df.loc['2020-06-26':'2020-06-28',['C','D']]

                   C         D
2020-06-26  2.243783 -0.263655
2020-06-27  1.467138  0.283153
2020-06-28 -0.663908  2.364393

In [16]:
df.iloc[[1,2],[1]]

                   B
2020-06-26 -0.047341
2020-06-27 -0.882125

In [17]:
df.iloc[1:3,[1]]

                   B
2020-06-26 -0.047341
2020-06-27 -0.882125

In [18]:
df.iloc[0,0] = 1000

In [19]:
df

                      A         B         C         D
2020-06-25  1000.000000  0.602988  0.185044 -0.276203
2020-06-26    -0.179998 -0.047341  2.243783 -0.263655
2020-06-27     0.722831 -0.882125  1.467138  0.283153
2020-06-28     0.135729 -1.461945 -0.663908  2.364393
2020-06-29     0.255790 -0.728395  0.231229 -0.934606
2020-06-30     0.475465  1.174095  0.585591  1.419549

In [20]:
df.loc['2020-07-01'] = [100,200,300,400]

In [21]:
df

                               A           B           C           D
2020-06-25 00:00:00  1000.000000    0.602988    0.185044   -0.276203
2020-06-26 00:00:00    -0.179998   -0.047341    2.243783   -0.263655
2020-06-27 00:00:00     0.722831   -0.882125    1.467138    0.283153
2020-06-28 00:00:00     0.135729   -1.461945   -0.663908    2.364393
2020-06-29 00:00:00     0.255790   -0.728395    0.231229   -0.934606
2020-06-30 00:00:00     0.475465    1.174095    0.585591    1.419549
2020-07-01            100.000000  200.000000  300.000000  400.000000

In [22]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [23]:
df['E'] = (df['B']+df['C'])

In [24]:
df

,A,B,C,D,E
2020-06-25 00:00:00,1000.000000,0.602988,0.185044,-0.276203,0.788031
2020-06-26 00:00:00,-0.179998,-0.047341,2.243783,-0.263655,2.196442
2020-06-27 00:00:00,0.722831,-0.882125,1.467138,0.283153,0.585012
2020-06-28 00:00:00,0.135729,-1.461945,-0.663908,2.364393,-2.125853
2020-06-29 00:00:00,0.255790,-0.728395,0.231229,-0.934606,-0.497167
2020-06-30 00:00:00,0.475465,1.174095,0.585591,1.419549,1.759685
2020-07-01,100.000000,200.000000,300.000000,400.000000,500.000000

In [25]:
df = df*2

In [26]:
df

,A,B,C,D,E
2020-06-25 00:00:00,2000.000000,1.205975,0.370088,-0.552407,1.576063
2020-06-26 00:00:00,-0.359997,-0.094681,4.487566,-0.527311,4.392885
2020-06-27 00:00:00,1.445663,-1.764250,2.934275,0.566307,1.170025
2020-06-28 00:00:00,0.271457,-2.923890,-1.327816,4.728787,-4.251706
2020-06-29 00:00:00,0.511580,-1.456791,0.462458,-1.869213,-0.994333
2020-06-30 00:00:00,0.950931,2.348189,1.171181,2.839098,3.519370
2020-07-01,200.000000,400.000000,600.000000,800.000000,1000.000000

In [27]:
df1 = pd.read_csv('data/concat_1.csv')
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [28]:
df2 = pd.read_csv('data/concat_2.csv')
df2

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [29]:
df3 = pd.read_csv('data/concat_3.csv')
df3

    A    C    F    H
0  a0   b8   c8   d8
1  a1   b9   c9   d9
2  a2  b10  c10  d10
3  a3  b11  c11  d11

In [30]:
row_concat = pd.concat([df2,df3,df4],ignore_index=True)
row_concat

NameError: name 'df4' is not defined

In [ ]:
df1 = pd.read_csv('data/concat_1.csv')
df2 = pd.read_csv('data/concat_2.csv')
df3 = pd.read_csv('data/concat_3.csv')

In [ ]:
row_concat = pd.concat([df2,df3,df4],ignore_index=True)

In [ ]:
row_concat

In [ ]:
df1.append(df2)

row_append2 = df1.append(df2, ignore_index = True)

In [31]:
row_append2 #append함수를 이용하여 row를 추가하는 경우는 추가되는 대상이 데이터 프레임이여야 한다.

NameError: name 'row_append2' is not defined

In [32]:
#한 row만 넣고 싶은 경우는, dictionary로 만들어 추가한다.

In [33]:
new_dic = {'A':'new1', 'B':'new1', 'C':'new1', 'D':'new1'} #키 역할을 컬럼명으로 시키렬함

In [34]:
df4 = df1.append(new_dic, ignore_index=True) #df4는 df1에 어펜드시켜, new_dic 변수를 추가시키고, 이그노어 인덱스는 무시해버려
df4

      A     B     C     D
0    a0    b0    c0    d0
1    a1    b1    c1    d1
2    a2    b2    c2    d2
3    a3    b3    c3    d3
4  new1  new1  new1  new1

In [35]:
result1 = pd.concat([df1, df2, df3]) #outerjoin 방식, 내가 없는것도 다 가져와라 = 없는항목도 조인시킴
result1

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    D    E    F    G    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   a4   b4   c4   d4
1  NaN  NaN  NaN  NaN   a5   b5   c5   d5
2  NaN  NaN  NaN  NaN   a6   b6   c6   d6
3  NaN  NaN  NaN  NaN   a7   b7   c7   d7
0   a0  NaN   b8  NaN  NaN   c8  NaN   d8
1   a1  NaN   b9  NaN  NaN   c9  NaN   d9
2   a2  NaN  b10  NaN  NaN  c10  NaN  d10
3   a3  NaN  b11  NaN  NaN  c11  NaN  d11

In [36]:
result2 = pd.concat([df1, df2, df3], join='inner') #outerjoin 방식, 내가 있는것만 가져와라 = 공통
result2

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]

In [37]:
df3

    A    C    F    H
0  a0   b8   c8   d8
1  a1   b9   c9   d9
2  a2  b10  c10  d10
3  a3  b11  c11  d11

In [38]:
df2

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [39]:
df1

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [40]:
result3 = pd.concat([df2, df3], join='inner') #outerjoin 방식, 내가 있는것만 가져와라 = 공통
result3 #concat 그냥 합치는 것. (-> 2개이상 합침)
#append 의 차이점은 없음. (-> 1대1)  = 2개
#append와 comcat은 행을 합치는 것 =>

     F    H
0   b4   d4
1   b5   d5
2   b6   d6
3   b7   d7
0   c8   d8
1   c9   d9
2  c10  d10
3  c11  d11

In [41]:
#mergs는 열을 합치는 것 -> merge는 공통 '열' 기준으로 합친다.
result5 = df1.merge(df3, on='A') #A를 공통칼럼으로 잡고, 열을 합침
#칼럼 이름이 다를땐, 
result55 = df1.merge(df3, left_on='A', right_on='A') #A를 공통칼럼으로 잡고, 열을 합침
result5

    A   B C_x   D  C_y    F    H
0  a0  b0  c0  d0   b8   c8   d8
1  a1  b1  c1  d1   b9   c9   d9
2  a2  b2  c2  d2  b10  c10  d10
3  a3  b3  c3  d3  b11  c11  d11

In [42]:
#merge 함수는 한 컬럼을 기준으로 합침
#left_join -> 왼쪽컬럼 기준으로 합침
#기준이 되는 컬럼이 반드시 존재해야 함
#right_join ->

In [43]:
table1 = pd.read_csv('data/korean_english.csv')
table2 = pd.read_csv('data/math.csv')

In [44]:
table1

   id  korean  english
0   1      95       99
1   2      80       98
2   3      75       97
3   4      55       96
4   5      65       95

In [45]:
table2

   id  math
0   1    77
1   2    76
2   3    75
3   4    74
4   5    73

In [46]:
result_on = table1.merge(table2, on='id') #id를 공통칼럼으로 잡고, 열을 합침
result_on

   id  korean  english  math
0   1      95       99    77
1   2      80       98    76
2   3      75       97    75
3   4      55       96    74
4   5      65       95    73

In [47]:
이름 = ['hong', 'jung', 'kim']
수학 = [90,66,77]
과학 = [25,76,25]

In [49]:
data_frame = pd.DataFrame({'이름':이름, '수학':수학, '과학':과학}) #딕셔너리로 넣어줍니다. SeriesType

In [50]:
data_frame

     이름  수학  과학
0  hong  90  25
1  jung  66  76
2   kim  77  25